docs-generated/test-reports/esg/saml/authz/service/impl/8_SAMLAuthorizationServiceSoapImplTest-out.txt

[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ValidatorSuites
[INFO] org.opensaml.xml.XMLConfigurator: ValidatorSuites load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] org.opensaml.xml.XMLConfigurator: Preparing to load ObjectProviders
[INFO] org.opensaml.xml.XMLConfigurator: ObjectProviders load complete
[INFO] esg.saml.common.SAMLBuilder: SAML libraries initialized correctly
[DEBUG] esg.saml.authz.service.impl.SAMLAuthorizationServiceSoapImpl: SOAP request:
<?xml version="1.0" encoding="UTF-8"?><soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
   <soap11:Body>
<samlp:AuthzDecisionQuery xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" ID="7658c723-7aef-478c-badf-c6cee670761f" IssueInstant="2010-01-26T18:18:10.927Z" Resource="/home/neillm/testfile1" Version="2.0">
   <saml:Subject xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">
      <saml:NameID>Test Openid</saml:NameID>
   </saml:Subject>
   <saml:Action xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion">Read</saml:Action>
</samlp:AuthzDecisionQuery>
   </soap11:Body>
</soap11:Envelope>

[DEBUG] esg.saml.authz.service.impl.SAMLAuthorizationServiceSoapImpl: SOAP response:
<?xml version="1.0" encoding="UTF-8"?><soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
   <soap11:Body>
      <samlp:Response xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol" InResponseTo="7658c723-7aef-478c-badf-c6cee670761f" Version="2.0">
         <saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" Format="urn:oasis:names:tc:SAML:1.1:nameid-format:x509SubjectName">Test SAML Issuer</saml:Issuer>
         <samlp:Status>
            <samlp:StatusCode Value="urn:oasis:names:tc:SAML:2.0:status:Success"/>
         </samlp:Status>
         <saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion" Version="2.0">
            <saml:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:x509SubjectName">Test SAML Issuer</saml:Issuer>
            <saml:Subject>
               <saml:NameID Format="urn:esg:openid">Test Openid</saml:NameID>
            </saml:Subject>
            <saml:AuthzDecisionStatement Decision="Permit" Resource="/home/neillm/testfile1">
               <saml:Action>Read</saml:Action>
            </saml:AuthzDecisionStatement>
         </saml:Assertion>
      </samlp:Response>
   </soap11:Body>
</soap11:Envelope>


